a = b = 2  		# Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому

print("b = " + str(b))


hello = "Привет"

print("hello = " + str(hello))

# Переопределите значение переменной hello

print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел

# print(...)
x = 7
y = "раз"
z = "отмерь"
i = 1
n = "раз"
m = "отрежь"
print("x =", str(x), "y =", str(y), "z =", str(z), "i =", str(i), "n =", str(n), "m =", str(m))
